#### Terraform Validation & Plan Results
* Terraform Version 📎`1.10.2`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.data_management_zone.module.datamanagement.time_rotating.databricks_account_scim_token_regenerate: Refreshing state... [id=2024-12-18T09:44:55Z][0m
[0m[1mmodule.data_management_zone.module.datamanagement.azurerm_resource_group.connectivity_synapse_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-syn-rg][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_scim.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.azurerm_resource_group.container_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg][0m
[0m[1mmodule.data_management_zone.module.platform.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_scim.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.module.platform.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.platform.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.azurerm_resource_group.connectivity_adb_rg["northeurope"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_resource_group.resource_group_network_databricks: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg][0m
[0m[1mmodule.data_management_zone.module.datamanagement.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.azurerm_resource_group.connectivity_adb_rg["westus"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg][0m
[0m[1mmodule.data_management_zone.module.datamanagement.azurerm_resource_group.governance_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg][0m
[0m[1mmodule.data_management_zone.module.datamanagement.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.module.datamanagement.azurerm_resource_group.scim_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-scim-rg][0m
[0m[1mmodule.data_management_zone.module.datamanagement.azurerm_resource_group.automation_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-automation-rg][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.purview_account[0].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.purview_account[0].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_purview.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_purview.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_resource_group.resource_group_private_dns: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg][0m
[0m[1mmodule.data_management_zone.module.platform.data.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.synapse_private_link_hub.azurerm_synapse_private_link_hub.synapse_private_link_hub: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-syn-rg/providers/Microsoft.Synapse/privateLinkHubs/mydmgmtdevsynplh001][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.container_registry.azurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-automation-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mydmgmt-dev-uai001][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_private_dns_zone.private_dns_zone["blob"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net][0m
[0m[1mmodule.data_management_zone.module.platform.data.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_private_dns_zone.private_dns_zone["databricks"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_private_dns_zone.private_dns_zone["dfs"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_route_table.route_table_databricks["northeurope"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-northeurope-rt001][0m
[0m[1mmodule.data_management_zone.module.platform.data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_route_table.route_table_databricks["westus"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-westus-rt001][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_network_security_group.network_security_group_databricks["northeurope"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-northeurope-nsg001][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_network_security_group.network_security_group_databricks["westus"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-westus-nsg001][0m
[0m[1mmodule.data_management_zone.module.platform.azapi_update_resource.virtual_network: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_scim.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-scim-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv002][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_access_connector["northeurope"].azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-northeurope-dbac001][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_access_connector["westus"].azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-westus-dbac001][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.purview_account[0].azapi_resource.purview_account: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_purview.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_virtual_network.virtual_network_databricks["westus"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_virtual_network.virtual_network_databricks["northeurope"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.purview_account[0].azurerm_monitor_diagnostic_setting.diagnostic_setting_purview_account["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.synapse_private_link_hub.azurerm_private_endpoint.private_endpoint_synapse_private_link_hub_web: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-syn-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-web-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.purview_account[0].azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_blob: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-blob-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.container_registry.azurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevacr001-registry-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.purview_account[0].azurerm_private_endpoint.private_endpoint_purview_account_platform: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-platform-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.purview_account[0].azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_queue: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-queue-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_scim.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-scim-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv002/providers/Microsoft.Authorization/roleAssignments/b89d8f5f-b94d-1bc2-7849-0ef4271bedbb][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_scim.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-scim-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-kv002-vault-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_scim.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_purview.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_purview.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001/providers/Microsoft.Authorization/roleAssignments/608256d7-ea5f-76e7-bfba-cbf14edada8f][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_purview.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-kv001-vault-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_scim.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-scim-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv002][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["westus-dfs"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net/virtualNetworkLinks/westus-dfs][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["northeurope-databricks"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net/virtualNetworkLinks/northeurope-databricks][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_purview.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["westus-blob"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/westus-blob][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["northeurope-blob"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/northeurope-blob][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["northeurope-dfs"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net/virtualNetworkLinks/northeurope-dfs][0m
[0m[1mmodule.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["westus-databricks"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net/virtualNetworkLinks/westus-databricks][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.container_registry.azurerm_monitor_diagnostic_setting.diagnostic_setting_container_registry["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_scim.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-scim-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv002|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_purview.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.synapse_private_link_hub.time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-18T09:47:08Z][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.container_registry.time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-18T09:47:16Z][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_scim.time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-18T09:48:11Z][0m
[0m[1mmodule.data_management_zone.module.datamanagement.null_resource.databricks_account_scim_token: Refreshing state... [id=449080168172161288][0m
[0m[1mmodule.data_management_zone.module.datamanagement.data.azurerm_key_vault_secret.key_vault_secret_databricks_account_scim_token: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.purview_account[0].time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-18T09:50:00Z][0m
[0m[1mmodule.data_management_zone.module.datamanagement.azurerm_role_assignment.purview_roleassignment_key_vault[0]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001/providers/Microsoft.Authorization/roleAssignments/f684222d-39a4-18fa-ef5d-bb1f192d38a1][0m
[0m[1mmodule.data_management_zone.module.datamanagement.data.azurerm_key_vault_secret.key_vault_secret_databricks_account_scim_token: Read complete after 0s [id=https://mydmgmt-dev-kv002.vault.azure.net/secrets/scim-token/eb48f78411b541dcb149c1dd422b9757][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_purview.time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-18T09:48:16Z][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-dfs-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-dfs-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-uiapi-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-blob-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-uiapi-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-blob-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-auth-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-auth-pe][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-18T09:53:20Z][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-18T09:53:20Z][0m
[0m[1mmodule.data_management_zone.module.datamanagement.time_sleep.sleep_databricks_workspace["westus"]: Refreshing state... [id=2024-12-18T11:03:46Z][0m
[0m[1mmodule.data_management_zone.module.datamanagement.time_sleep.sleep_databricks_workspace["northeurope"]: Refreshing state... [id=2024-12-18T11:03:46Z][0m
[0m[1mmodule.data_management_zone.module.datamanagement.null_resource.system_schema["northeurope"]: Refreshing state... [id=8208569216095886957][0m
[0m[1mmodule.data_management_zone.module.datamanagement.null_resource.system_schema["westus"]: Refreshing state... [id=8935809212294454771][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].azapi_resource.purview_account[0m has been deleted
[0m  [31m-[0m[0m resource "azapi_resource" "purview_account" {
      [31m-[0m[0m id                        = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001" [90m-> null[0m[0m
      [31m-[0m[0m name                      = "mydmgmt-dev-pview001" [90m-> null[0m[0m
      [31m-[0m[0m output                    = {
            id         = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001"
            name       = "mydmgmt-dev-pview001"
          [31m-[0m[0m properties = {
              [31m-[0m[0m endpoints                           = {
                  [31m-[0m[0m catalog = "https://37963dd4-f4e6-40f8-a7d6-24b97919e452-api.purview-service.microsoft.com/catalog"
                  [31m-[0m[0m scan    = "https://37963dd4-f4e6-40f8-a7d6-24b97919e452-api.purview-service.microsoft.com/scan"
                }
              [31m-[0m[0m ingestionStorage                    = {
                  [31m-[0m[0m id                  = "/subscriptions/73fdb71f-7214-4241-ab61-b35b2dbed29f/resourceGroups/ingestion-storage-rg-westus-7/providers/Microsoft.Storage/storageAccounts/ingestionwuspykdbve"
                  [31m-[0m[0m primaryEndpoint     = "https://ingestionwuspykdbve.z49.blob.storage.azure.net/"
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
                [90m# (13 unchanged attributes hidden)[0m[0m
            }
            [90m# (5 unchanged attributes hidden)[0m[0m
        } [90m-> null[0m[0m
        tags                      = {}
        [90m# (9 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m identity {
          [31m-[0m[0m principal_id = "56ad0574-297f-4a39-9760-65af1ecaf5f3" [90m-> null[0m[0m
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_management_zone.module.datamanagement.azurerm_role_assignment.purview_roleassignment_key_vault[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "purview_roleassignment_key_vault" {
      [32m+[0m[0m condition_version                      = (known after apply)
      [33m~[0m[0m id                                     = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001/providers/Microsoft.Authorization/roleAssignments/f684222d-39a4-18fa-ef5d-bb1f192d38a1" -> (known after apply)
      [33m~[0m[0m name                                   = "f684222d-39a4-18fa-ef5d-bb1f192d38a1" -> (known after apply)
      [33m~[0m[0m principal_id                           = "56ad0574-297f-4a39-9760-65af1ecaf5f3" -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m principal_type                         = "ServicePrincipal" -> (known after apply)
      [33m~[0m[0m role_definition_id                     = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check       = (known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.platform.azurerm_network_security_group.network_security_group_databricks["northeurope"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_security_group" "network_security_group_databricks" {
      [33m~[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-northeurope-nsg001" -> (known after apply)
        name                = "mydmgmt-dev-northeurope-nsg001"
      [33m~[0m[0m resource_group_name = "mydmgmt-dev-monitoring-rg" [33m->[0m[0m "mydmgmt-dev-network-databricks-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m security_rule       = [
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker communication with Azure Eventhub services."
              [31m-[0m[0m destination_address_prefix                 = "EventHub"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "9093"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-eventhub"
              [31m-[0m[0m priority                                   = 103
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker nodes communication within a cluster."
              [31m-[0m[0m destination_address_prefix                 = "VirtualNetwork"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "*"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Inbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-worker-inbound"
              [31m-[0m[0m priority                                   = 100
              [31m-[0m[0m protocol                                   = "*"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker nodes communication within a cluster."
              [31m-[0m[0m destination_address_prefix                 = "VirtualNetwork"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "*"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-worker-outbound"
              [31m-[0m[0m priority                                   = 100
              [31m-[0m[0m protocol                                   = "*"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for workers communication with Azure SQL services."
              [31m-[0m[0m destination_address_prefix                 = "Sql"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "3306"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-sql"
              [31m-[0m[0m priority                                   = 101
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for workers communication with Azure Storage services."
              [31m-[0m[0m destination_address_prefix                 = "Storage"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "443"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-storage"
              [31m-[0m[0m priority                                   = 102
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
        ] -> (known after apply)
      [31m-[0m[0m tags                = {} [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.platform.azurerm_network_security_group.network_security_group_databricks["westus"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_security_group" "network_security_group_databricks" {
      [33m~[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-westus-nsg001" -> (known after apply)
        name                = "mydmgmt-dev-westus-nsg001"
      [33m~[0m[0m resource_group_name = "mydmgmt-dev-monitoring-rg" [33m->[0m[0m "mydmgmt-dev-network-databricks-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m security_rule       = [
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker communication with Azure Eventhub services."
              [31m-[0m[0m destination_address_prefix                 = "EventHub"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "9093"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-eventhub"
              [31m-[0m[0m priority                                   = 103
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker nodes communication within a cluster."
              [31m-[0m[0m destination_address_prefix                 = "VirtualNetwork"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "*"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Inbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-worker-inbound"
              [31m-[0m[0m priority                                   = 100
              [31m-[0m[0m protocol                                   = "*"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker nodes communication within a cluster."
              [31m-[0m[0m destination_address_prefix                 = "VirtualNetwork"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "*"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-worker-outbound"
              [31m-[0m[0m priority                                   = 100
              [31m-[0m[0m protocol                                   = "*"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for workers communication with Azure SQL services."
              [31m-[0m[0m destination_address_prefix                 = "Sql"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "3306"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-sql"
              [31m-[0m[0m priority                                   = 101
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for workers communication with Azure Storage services."
              [31m-[0m[0m destination_address_prefix                 = "Storage"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "443"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-storage"
              [31m-[0m[0m priority                                   = 102
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
        ] -> (known after apply)
      [31m-[0m[0m tags                = {} [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["northeurope-blob"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_zone_virtual_network_links" {
      [33m~[0m[0m id                    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/northeurope-blob" -> (known after apply)
        name                  = "northeurope-blob"
      [31m-[0m[0m tags                  = {} [90m-> null[0m[0m
      [33m~[0m[0m virtual_network_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["northeurope-databricks"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_zone_virtual_network_links" {
      [33m~[0m[0m id                    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net/virtualNetworkLinks/northeurope-databricks" -> (known after apply)
        name                  = "northeurope-databricks"
      [31m-[0m[0m tags                  = {} [90m-> null[0m[0m
      [33m~[0m[0m virtual_network_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["northeurope-dfs"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_zone_virtual_network_links" {
      [33m~[0m[0m id                    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net/virtualNetworkLinks/northeurope-dfs" -> (known after apply)
        name                  = "northeurope-dfs"
      [31m-[0m[0m tags                  = {} [90m-> null[0m[0m
      [33m~[0m[0m virtual_network_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["westus-blob"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_zone_virtual_network_links" {
      [33m~[0m[0m id                    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/westus-blob" -> (known after apply)
        name                  = "westus-blob"
      [31m-[0m[0m tags                  = {} [90m-> null[0m[0m
      [33m~[0m[0m virtual_network_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["westus-databricks"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_zone_virtual_network_links" {
      [33m~[0m[0m id                    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net/virtualNetworkLinks/westus-databricks" -> (known after apply)
        name                  = "westus-databricks"
      [31m-[0m[0m tags                  = {} [90m-> null[0m[0m
      [33m~[0m[0m virtual_network_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["westus-dfs"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_zone_virtual_network_links" {
      [33m~[0m[0m id                    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net/virtualNetworkLinks/westus-dfs" -> (known after apply)
        name                  = "westus-dfs"
      [31m-[0m[0m tags                  = {} [90m-> null[0m[0m
      [33m~[0m[0m virtual_network_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.platform.azurerm_resource_group.resource_group_network_databricks[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_resource_group" "resource_group_network_databricks" {
      [33m~[0m[0m id         = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg" -> (known after apply)
      [33m~[0m[0m name       = "mydmgmt-dev-monitoring-rg" [33m->[0m[0m "mydmgmt-dev-network-databricks-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags       = {} [90m-> null[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.platform.azurerm_route_table.route_table_databricks["northeurope"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_route_table" "route_table_databricks" {
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-northeurope-rt001" -> (known after apply)
        name                          = "mydmgmt-dev-northeurope-rt001"
      [33m~[0m[0m resource_group_name           = "mydmgmt-dev-monitoring-rg" [33m->[0m[0m "mydmgmt-dev-network-databricks-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m subnets                       = [
          [31m-[0m[0m "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/DatabricksPrivateSubnet",
          [31m-[0m[0m "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/DatabricksPublicSubnet",
          [31m-[0m[0m "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/PrivateEndpointSubnet",
        ] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.platform.azurerm_route_table.route_table_databricks["westus"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_route_table" "route_table_databricks" {
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-westus-rt001" -> (known after apply)
        name                          = "mydmgmt-dev-westus-rt001"
      [33m~[0m[0m resource_group_name           = "mydmgmt-dev-monitoring-rg" [33m->[0m[0m "mydmgmt-dev-network-databricks-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m subnets                       = [
          [31m-[0m[0m "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/DatabricksPrivateSubnet",
          [31m-[0m[0m "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/DatabricksPublicSubnet",
          [31m-[0m[0m "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/PrivateEndpointSubnet",
        ] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.platform.azurerm_virtual_network.virtual_network_databricks["northeurope"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_virtual_network" "virtual_network_databricks" {
      [31m-[0m[0m flow_timeout_in_minutes = 0 [90m-> null[0m[0m
      [33m~[0m[0m guid                    = "d9c116b9-077b-4f40-adba-b3b8da1871e1" -> (known after apply)
      [33m~[0m[0m id                      = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001" -> (known after apply)
        name                    = "mydmgmt-dev-northeurope-vnet001"
      [33m~[0m[0m resource_group_name     = "mydmgmt-dev-monitoring-rg" [33m->[0m[0m "mydmgmt-dev-network-databricks-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m subnet                  = [
          [31m-[0m[0m {
              [31m-[0m[0m address_prefixes                              = [
                  [31m-[0m[0m "10.0.0.0/26",
                ]
              [31m-[0m[0m default_outbound_access_enabled               = true
              [31m-[0m[0m delegation                                    = [
                  [31m-[0m[0m {
                      [31m-[0m[0m name               = "DatabricksDelegation"
                      [31m-[0m[0m service_delegation = [
                          [31m-[0m[0m {
                              [31m-[0m[0m actions = [
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [31m-[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [31m-[0m[0m id                                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/DatabricksPrivateSubnet"
              [31m-[0m[0m name                                          = "DatabricksPrivateSubnet"
              [31m-[0m[0m private_endpoint_network_policies             = "Enabled"
              [31m-[0m[0m private_link_service_network_policies_enabled = true
              [31m-[0m[0m route_table_id                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-northeurope-rt001"
              [31m-[0m[0m security_group                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-northeurope-nsg001"
              [31m-[0m[0m service_endpoint_policy_ids                   = []
              [31m-[0m[0m service_endpoints                             = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m address_prefixes                              = [
                  [31m-[0m[0m "10.0.0.128/26",
                ]
              [31m-[0m[0m default_outbound_access_enabled               = true
              [31m-[0m[0m delegation                                    = []
              [31m-[0m[0m id                                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/PrivateEndpointSubnet"
              [31m-[0m[0m name                                          = "PrivateEndpointSubnet"
              [31m-[0m[0m private_endpoint_network_policies             = "Enabled"
              [31m-[0m[0m private_link_service_network_policies_enabled = true
              [31m-[0m[0m route_table_id                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-northeurope-rt001"
              [31m-[0m[0m security_group                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-northeurope-nsg001"
              [31m-[0m[0m service_endpoint_policy_ids                   = []
              [31m-[0m[0m service_endpoints                             = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m address_prefixes                              = [
                  [31m-[0m[0m "10.0.0.64/26",
                ]
              [31m-[0m[0m default_outbound_access_enabled               = true
              [31m-[0m[0m delegation                                    = [
                  [31m-[0m[0m {
                      [31m-[0m[0m name               = "DatabricksDelegation"
                      [31m-[0m[0m service_delegation = [
                          [31m-[0m[0m {
                              [31m-[0m[0m actions = [
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [31m-[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [31m-[0m[0m id                                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/DatabricksPublicSubnet"
              [31m-[0m[0m name                                          = "DatabricksPublicSubnet"
              [31m-[0m[0m private_endpoint_network_policies             = "Enabled"
              [31m-[0m[0m private_link_service_network_policies_enabled = true
              [31m-[0m[0m route_table_id                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-northeurope-rt001"
              [31m-[0m[0m security_group                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-northeurope-nsg001"
              [31m-[0m[0m service_endpoint_policy_ids                   = []
              [31m-[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.0/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPrivateSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.128/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = []
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "PrivateEndpointSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.64/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPublicSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
        ]
      [31m-[0m[0m tags                    = {} [90m-> null[0m[0m
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.platform.azurerm_virtual_network.virtual_network_databricks["westus"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_virtual_network" "virtual_network_databricks" {
      [31m-[0m[0m flow_timeout_in_minutes = 0 [90m-> null[0m[0m
      [33m~[0m[0m guid                    = "2382719a-92ad-4fd6-80f0-8978ad8a534d" -> (known after apply)
      [33m~[0m[0m id                      = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001" -> (known after apply)
        name                    = "mydmgmt-dev-westus-vnet001"
      [33m~[0m[0m resource_group_name     = "mydmgmt-dev-monitoring-rg" [33m->[0m[0m "mydmgmt-dev-network-databricks-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m subnet                  = [
          [31m-[0m[0m {
              [31m-[0m[0m address_prefixes                              = [
                  [31m-[0m[0m "10.0.0.0/26",
                ]
              [31m-[0m[0m default_outbound_access_enabled               = true
              [31m-[0m[0m delegation                                    = [
                  [31m-[0m[0m {
                      [31m-[0m[0m name               = "DatabricksDelegation"
                      [31m-[0m[0m service_delegation = [
                          [31m-[0m[0m {
                              [31m-[0m[0m actions = [
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [31m-[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [31m-[0m[0m id                                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/DatabricksPrivateSubnet"
              [31m-[0m[0m name                                          = "DatabricksPrivateSubnet"
              [31m-[0m[0m private_endpoint_network_policies             = "Enabled"
              [31m-[0m[0m private_link_service_network_policies_enabled = true
              [31m-[0m[0m route_table_id                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-westus-rt001"
              [31m-[0m[0m security_group                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-westus-nsg001"
              [31m-[0m[0m service_endpoint_policy_ids                   = []
              [31m-[0m[0m service_endpoints                             = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m address_prefixes                              = [
                  [31m-[0m[0m "10.0.0.128/26",
                ]
              [31m-[0m[0m default_outbound_access_enabled               = true
              [31m-[0m[0m delegation                                    = []
              [31m-[0m[0m id                                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/PrivateEndpointSubnet"
              [31m-[0m[0m name                                          = "PrivateEndpointSubnet"
              [31m-[0m[0m private_endpoint_network_policies             = "Enabled"
              [31m-[0m[0m private_link_service_network_policies_enabled = true
              [31m-[0m[0m route_table_id                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-westus-rt001"
              [31m-[0m[0m security_group                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-westus-nsg001"
              [31m-[0m[0m service_endpoint_policy_ids                   = []
              [31m-[0m[0m service_endpoints                             = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m address_prefixes                              = [
                  [31m-[0m[0m "10.0.0.64/26",
                ]
              [31m-[0m[0m default_outbound_access_enabled               = true
              [31m-[0m[0m delegation                                    = [
                  [31m-[0m[0m {
                      [31m-[0m[0m name               = "DatabricksDelegation"
                      [31m-[0m[0m service_delegation = [
                          [31m-[0m[0m {
                              [31m-[0m[0m actions = [
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [31m-[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [31m-[0m[0m id                                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/DatabricksPublicSubnet"
              [31m-[0m[0m name                                          = "DatabricksPublicSubnet"
              [31m-[0m[0m private_endpoint_network_policies             = "Enabled"
              [31m-[0m[0m private_link_service_network_policies_enabled = true
              [31m-[0m[0m route_table_id                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-westus-rt001"
              [31m-[0m[0m security_group                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-westus-nsg001"
              [31m-[0m[0m service_endpoint_policy_ids                   = []
              [31m-[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.0/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPrivateSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.128/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = []
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "PrivateEndpointSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.64/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPublicSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
        ]
      [31m-[0m[0m tags                    = {} [90m-> null[0m[0m
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_databricks_workspace" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].azurerm_databricks_workspace.databricks_workspace[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_databricks_workspace" "databricks_workspace" {
      [32m+[0m[0m disk_encryption_set_id                              = (known after apply)
      [33m~[0m[0m id                                                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001" -> (known after apply)
      [31m-[0m[0m managed_disk_cmk_rotation_to_latest_version_enabled = false [90m-> null[0m[0m
      [33m~[0m[0m managed_disk_identity                               = [] -> (known after apply)
      [33m~[0m[0m managed_resource_group_id                           = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-northeurope-dbw001-rg" -> (known after apply)
        name                                                = "mydmgmt-dev-northeurope-dbw001"
      [33m~[0m[0m storage_account_identity                            = [] -> (known after apply)
      [31m-[0m[0m tags                                                = {} [90m-> null[0m[0m
      [33m~[0m[0m workspace_id                                        = "2855095353791973" -> (known after apply)
      [33m~[0m[0m workspace_url                                       = "adb-2855095353791973.13.azuredatabricks.net" -> (known after apply)
        [90m# (15 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m custom_parameters {
          [32m+[0m[0m nat_gateway_name                                     = (known after apply)
          [33m~[0m[0m private_subnet_network_security_group_association_id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/DatabricksPrivateSubnet" -> (known after apply)
          [33m~[0m[0m public_ip_name                                       = "nat-gw-public-ip" -> (known after apply)
          [33m~[0m[0m public_subnet_network_security_group_association_id  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/DatabricksPublicSubnet" -> (known after apply)
          [33m~[0m[0m storage_account_name                                 = "dbstorage2guztbnlpsnek" -> (known after apply)
          [33m~[0m[0m virtual_network_id                                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m vnet_address_prefix                                  = "10.139" -> (known after apply)
            [90m# (5 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_databricks_workspace" {
      [33m~[0m[0m id                             = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001|applicationLogs-0" -> (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
        name                           = "applicationLogs-0"
      [33m~[0m[0m target_resource_id             = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_browser_authentication" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-auth-pe" -> (known after apply)
        name                          = "mydmgmt-dev-northeurope-dbw001-auth-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-northeurope-dbw001-auth-nic"
              [31m-[0m[0m name = "mydmgmt-dev-northeurope-dbw001-auth-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-auth-pe/privateDnsZoneGroups/mydmgmt-dev-northeurope-dbw001-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "northeurope.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.18",
                        ]
                      [31m-[0m[0m name         = "northeurope.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "northeurope-c2.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.19",
                        ]
                      [31m-[0m[0m name         = "northeurope-c2.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-auth-pe/privateDnsZoneGroups/mydmgmt-dev-northeurope-dbw001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-northeurope-dbw001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-northeurope-dbw001-auth-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.18" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_databricks_ui_api" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-uiapi-pe" -> (known after apply)
        name                          = "mydmgmt-dev-northeurope-dbw001-uiapi-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-northeurope-dbw001-uiapi-nic"
              [31m-[0m[0m name = "mydmgmt-dev-northeurope-dbw001-uiapi-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-uiapi-pe/privateDnsZoneGroups/mydmgmt-dev-northeurope-dbw001-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "adb-2855095353791973.13.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.15",
                        ]
                      [31m-[0m[0m name         = "adb-2855095353791973.13"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-uiapi-pe/privateDnsZoneGroups/mydmgmt-dev-northeurope-dbw001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-northeurope-dbw001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-northeurope-dbw001-uiapi-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.15" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_dbfs_blob" {
      [33m~[0m[0m custom_dns_configs            = [
          [31m-[0m[0m {
              [31m-[0m[0m fqdn         = "dbstorage2guztbnlpsnek.blob.core.windows.net"
              [31m-[0m[0m ip_addresses = [
                  [31m-[0m[0m "10.1.0.12",
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-blob-pe" -> (known after apply)
        name                          = "mydmgmt-dev-northeurope-dbw001-blob-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-northeurope-dbw001-blob-nic"
              [31m-[0m[0m name = "mydmgmt-dev-northeurope-dbw001-blob-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-northeurope-dbw001-blob-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-northeurope-dbw001-rg/providers/Microsoft.Storage/storageAccounts/dbstorage2guztbnlpsnek" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.12" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_dbfs_dfs" {
      [33m~[0m[0m custom_dns_configs            = [
          [31m-[0m[0m {
              [31m-[0m[0m fqdn         = "dbstorage2guztbnlpsnek.dfs.core.windows.net"
              [31m-[0m[0m ip_addresses = [
                  [31m-[0m[0m "10.1.0.16",
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-dfs-pe" -> (known after apply)
        name                          = "mydmgmt-dev-northeurope-dbw001-dfs-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-northeurope-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-northeurope-dbw001-dfs-nic"
              [31m-[0m[0m name = "mydmgmt-dev-northeurope-dbw001-dfs-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-northeurope-dbw001-dfs-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-northeurope-dbw001-rg/providers/Microsoft.Storage/storageAccounts/dbstorage2guztbnlpsnek" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.16" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_databricks_workspace" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].azurerm_databricks_workspace.databricks_workspace[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_databricks_workspace" "databricks_workspace" {
      [32m+[0m[0m disk_encryption_set_id                              = (known after apply)
      [33m~[0m[0m id                                                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001" -> (known after apply)
      [31m-[0m[0m managed_disk_cmk_rotation_to_latest_version_enabled = false [90m-> null[0m[0m
      [33m~[0m[0m managed_disk_identity                               = [] -> (known after apply)
      [33m~[0m[0m managed_resource_group_id                           = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-westus-dbw001-rg" -> (known after apply)
        name                                                = "mydmgmt-dev-westus-dbw001"
      [33m~[0m[0m storage_account_identity                            = [] -> (known after apply)
      [31m-[0m[0m tags                                                = {} [90m-> null[0m[0m
      [33m~[0m[0m workspace_id                                        = "1234332973507439" -> (known after apply)
      [33m~[0m[0m workspace_url                                       = "adb-1234332973507439.19.azuredatabricks.net" -> (known after apply)
        [90m# (15 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m custom_parameters {
          [32m+[0m[0m nat_gateway_name                                     = (known after apply)
          [33m~[0m[0m private_subnet_network_security_group_association_id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/DatabricksPrivateSubnet" -> (known after apply)
          [33m~[0m[0m public_ip_name                                       = "nat-gw-public-ip" -> (known after apply)
          [33m~[0m[0m public_subnet_network_security_group_association_id  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/DatabricksPublicSubnet" -> (known after apply)
          [33m~[0m[0m storage_account_name                                 = "dbstorageme7nirjeyelbo" -> (known after apply)
          [33m~[0m[0m virtual_network_id                                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-monitoring-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m vnet_address_prefix                                  = "10.139" -> (known after apply)
            [90m# (5 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_databricks_workspace" {
      [33m~[0m[0m id                             = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001|applicationLogs-0" -> (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
        name                           = "applicationLogs-0"
      [33m~[0m[0m target_resource_id             = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_browser_authentication" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-auth-pe" -> (known after apply)
        name                          = "mydmgmt-dev-westus-dbw001-auth-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-westus-dbw001-auth-nic"
              [31m-[0m[0m name = "mydmgmt-dev-westus-dbw001-auth-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-auth-pe/privateDnsZoneGroups/mydmgmt-dev-westus-dbw001-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "westus.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.20",
                        ]
                      [31m-[0m[0m name         = "westus.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "westus-c2.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.21",
                        ]
                      [31m-[0m[0m name         = "westus-c2.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-auth-pe/privateDnsZoneGroups/mydmgmt-dev-westus-dbw001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-westus-dbw001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-westus-dbw001-auth-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.20" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_databricks_ui_api" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-uiapi-pe" -> (known after apply)
        name                          = "mydmgmt-dev-westus-dbw001-uiapi-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-westus-dbw001-uiapi-nic"
              [31m-[0m[0m name = "mydmgmt-dev-westus-dbw001-uiapi-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-uiapi-pe/privateDnsZoneGroups/mydmgmt-dev-westus-dbw001-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "adb-1234332973507439.19.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.17",
                        ]
                      [31m-[0m[0m name         = "adb-1234332973507439.19"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-uiapi-pe/privateDnsZoneGroups/mydmgmt-dev-westus-dbw001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-westus-dbw001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-westus-dbw001-uiapi-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.17" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_dbfs_blob" {
      [33m~[0m[0m custom_dns_configs            = [
          [31m-[0m[0m {
              [31m-[0m[0m fqdn         = "dbstorageme7nirjeyelbo.blob.core.windows.net"
              [31m-[0m[0m ip_addresses = [
                  [31m-[0m[0m "10.1.0.14",
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-blob-pe" -> (known after apply)
        name                          = "mydmgmt-dev-westus-dbw001-blob-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-westus-dbw001-blob-nic"
              [31m-[0m[0m name = "mydmgmt-dev-westus-dbw001-blob-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-westus-dbw001-blob-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-westus-dbw001-rg/providers/Microsoft.Storage/storageAccounts/dbstorageme7nirjeyelbo" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.14" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_dbfs_dfs" {
      [33m~[0m[0m custom_dns_configs            = [
          [31m-[0m[0m {
              [31m-[0m[0m fqdn         = "dbstorageme7nirjeyelbo.dfs.core.windows.net"
              [31m-[0m[0m ip_addresses = [
                  [31m-[0m[0m "10.1.0.13",
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-dfs-pe" -> (known after apply)
        name                          = "mydmgmt-dev-westus-dbw001-dfs-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-connectivity-adb-westus-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-westus-dbw001-dfs-nic"
              [31m-[0m[0m name = "mydmgmt-dev-westus-dbw001-dfs-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-westus-dbw001-dfs-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-westus-dbw001-rg/providers/Microsoft.Storage/storageAccounts/dbstorageme7nirjeyelbo" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.13" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_purview_account[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_purview_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].azapi_resource.purview_account[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "purview_account" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m properties = {
              [32m+[0m[0m ingestionStorage                    = {
                  [32m+[0m[0m publicNetworkAccess = "Disabled"
                }
              [32m+[0m[0m managedEventHubState                = "Disabled"
              [32m+[0m[0m managedResourceGroupName            = "mydmgmt-dev-pview001-rg"
              [32m+[0m[0m managedResourcesPublicNetworkAccess = "Disabled"
              [32m+[0m[0m publicNetworkAccess                 = "Enabled"
              [32m+[0m[0m tenantEndpointState                 = "Enabled"
            }
          [32m+[0m[0m sku        = {
              [32m+[0m[0m capacity = 1
              [32m+[0m[0m name     = "Standard"
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = "westus"
      [32m+[0m[0m locks                     = []
      [32m+[0m[0m name                      = "mydmgmt-dev-pview001"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg"
      [32m+[0m[0m response_export_values    = [
          [32m+[0m[0m "*",
        ]
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = {}
      [32m+[0m[0m type                      = "Microsoft.Purview/accounts@2024-04-01-preview"

      [32m+[0m[0m identity {
          [32m+[0m[0m identity_ids = []
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].azurerm_monitor_diagnostic_setting.diagnostic_setting_purview_account["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_purview_account" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_blob[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_ingestion_storage_blob" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-ing-blob-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-ing-blob-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ServicesSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = true
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-ing-blob-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m request_message                = "Required for private connection."
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "blob",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_queue[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_ingestion_storage_queue" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-ing-queue-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-ing-queue-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ServicesSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = true
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-ing-queue-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m request_message                = "Required for private connection."
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "queue",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].azurerm_private_endpoint.private_endpoint_purview_account_platform[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_platform" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-platform-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-platform-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ServicesSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview-service.microsoft.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-platform-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "platform",
            ]
        }
    }

[1mPlan:[0m 31 to add, 0 to change, 26 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>